# Pandas Basic

In [1]:
import pandas as pd

## Creating a series with custom indexes

In [2]:



car_names = ["Toyota", "Honda", "Ford", "Chevrolet", "Nissan", "Volkswagen", "BMW", "Mercedes-Benz", "Audi", "Lexus", "Subaru", "Hyundai", "Kia", "Mazda", "Jeep", "Tesla", "Porsche", "Ferrari", "Lamborghini","Jeep"]
colors = ["Red", "Orange", "Yellow", "Green", "Blue", "Purple", "Pink", "Brown", "Gray", "Black", "White", "Cyan", "Magenta", "Lime", "Teal", "Maroon", "Navy", "Olive", "Indigo", "Turquoise"]

car_series = pd.Series(car_names, index=colors)
print(car_series)
print(car_series["Yellow"])

Red                 Toyota
Orange               Honda
Yellow                Ford
Green            Chevrolet
Blue                Nissan
Purple          Volkswagen
Pink                   BMW
Brown        Mercedes-Benz
Gray                  Audi
Black                Lexus
White               Subaru
Cyan               Hyundai
Magenta                Kia
Lime                 Mazda
Teal                  Jeep
Maroon               Tesla
Navy               Porsche
Olive              Ferrari
Indigo         Lamborghini
Turquoise             Jeep
dtype: object
Ford

In [3]:
# Creating a DataFrame from a dictionary of data
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data)

# Displaying the DataFrame
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [4]:
car_sales = pd.read_csv('car-sales.csv')

In [5]:
print(car_sales)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [6]:
exported_car_sales = car_sales.to_csv("exported-car-sales.csv",index=False)

In [7]:
pd.read_csv('exported-car-sales.csv')

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describe Data Using Pandas

### This gives info about the datatypes of all the columns

In [8]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

### Contains info about  the name of the columns in dataframe

In [9]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [10]:
columns = car_sales.columns

In [11]:
print(columns[0])

Make

In [12]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [13]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [14]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [15]:
car_sales.sum()  #returns the sum of all the column

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [16]:
car_sales["Doors"].sum(
    
) #returns the sum of the specified column

40

In [17]:
len(car_sales) # returns the numbers of rows

10

In [18]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [20]:
type(car_sales.index)

pandas.core.indexes.range.RangeIndex

## Viewing and Selecting Data

### to see first few columns of a dataframe

In [21]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

by default head will give us the first fivve rows or tuples of a dataframe

In [22]:
car_sales.head(6)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

we can specify the no. rows that we want by givng the function an argument

now just like head we also have a  tail function which give us the last few  tuples of the dat frame

In [23]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [24]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

just like head we can also specify the no. of row we want see starting from the last

## iloc and loc

In [25]:
data1 = {'A': 10, 'B': 20, 'C': 30, 'D': 40}
series1 = pd.Series(data)

In [26]:
series.loc['A']

10

In [51]:
letters = ['a','a','b','c','c','f','g']
indexes = [1,2,3,4,5,6,6]
series2 = pd.Series(letters,index=indexes)

In [31]:
series2

1     a
2     a
3     b
4     c
5     c
ww    f
6     g
dtype: object

In [32]:
series2.loc['ww']

'f'

In [33]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [34]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [37]:
type(car_sales.loc[3])

pandas.core.series.Series

In [44]:
## testing iloc 
series

A    10
B    20
C    30
D    40
dtype: int64

In [40]:
series.iloc[3]

40

iloc refers to the position

In [42]:
car_sales.iloc[2] ## refers to the postion no. 2 starting from 0

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

#### loc => index value

#### iloc => positon (starting from 0)

### slicing with iloc and loc

In [52]:
series2

1    a
2    a
3    b
4    c
5    c
6    f
6    g
dtype: object

In [53]:
series2.loc[2:6] ## this is just like list or string slicing

2    a
3    b
4    c
5    c
6    f
6    g
dtype: object

In [60]:
series2.iloc[1:7:2]

2    a
4    c
6    f
dtype: object

In [62]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [63]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [66]:
car_sales.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object